In [1]:
import pandas as pd
import numpy as np

In [2]:
credentials = {
    'region_name': 'us-east-1',
    'aws_access_key_id': 'ASIAWTURAYQ5AEYGJM5S',
    'aws_secret_access_key': '1DJn1aqNeOYU/Dq3AIU4ogEgxuCmcN33SqaLEZoW',
    'aws_session_token': 'FwoGZXIvYXdzED0aDBL38l0dcuz1G5eKmiLLARlUpO25PowrTpFEHhCl6ZGl6rtBckZPdD5yaUqOKnFrVsYDfNwmIOqV6+pQ7yAABLUkM9V68ABltwRBQxmibdRtfw1NiCq33daf+xc4b+m5iRaKIn0lHCOApHzKAiwmqzxsiq3PyrUYQ6GeYvwCG6w7NzJivlMvMXVv1PVPwJrI6+gh95t+/IHPajGviC4crt/TYjAZtIuRc/9/7HB6Hb0/d+n6TiDhctoiCgEGeK8mB3KBKyGgAAno+VjJ891S22g5XM2oCpPvgn/EKLODpqIGMi2ehugRWvaunUTJ/oyAlaQOZDqzhFBA2a7+xrR3Ih9hPsya7yzD5NT6meATe1c='
}

In [3]:
import boto3

session = boto3.session.Session(**credentials)
athena = session.client('athena', region_name='us-east-1')
s3 = session.client('s3')

In [4]:
def query_execute(query):
    exe = athena.start_query_execution(
        QueryString = query,
        QueryExecutionContext = {
            'Database': 'hima-db'
        }
    )
    
    athena.get_query_execution(
        QueryExecutionId= exe['QueryExecutionId']
    )
    
    print(exe['QueryExecutionId'])

## Rate query

In [6]:
# find average rates across year
query_execute('SELECT businessyear, age FROM "rate_table" GROUP BY businessyear, age')

0d1420e0-fecd-4dfd-b750-eb901919b29e

In [7]:
s3.download_file('mikeproject', 'results/0d1420e0-fecd-4dfd-b750-eb901919b29e.csv', 'individualrate_year.csv')

In [3]:
df = pd.read_csv('individualrate_year.csv', header=0, names=['year','age', 'individual_rate']).sort_values('individual_rate')

In [7]:
df[df.age != 'Family Option'].groupby('year').mean().transpose()

year                 2019.0      2020.0      2021.0      2022.0
individual_rate  325.764151  342.201209  378.964193  412.188214

In [22]:
# find average couple and dependent rates across year
query_execute("SELECT businessyear, AVG(individualrate), AVG(couple) , AVG(primarysubscriberandonedependent),\
                AVG(primarysubscriberandtwodependents), AVG(coupleandonedependent),\
                AVG(coupleandtwodependents)\
                FROM rate_table \
                WHERE age LIKE 'Family Option' \
                GROUP BY businessyear")

ddefffb8-56d2-4deb-99d7-86307f4f8d4f

In [23]:
s3.download_file('mikeproject', 'results/ddefffb8-56d2-4deb-99d7-86307f4f8d4f.csv', 'couple_year.csv')

In [25]:
pd.read_csv('couple_year.csv', header=0, names=['year','individual_rate', 'couple_rate',
                                               'primaryonedependent_rate','primarytwodependent_rate',
                                               'coupleonedependent_rate','coupleandtwodependents']).head()

,year,individual_rate,couple_rate,primaryonedependent_rate,primarytwodependent_rate,coupleonedependent_rate,coupleandtwodependents
0,2021,33.201820,61.81342,71.47634,88.070755,107.484726,113.469900
1,2022,29.718306,54.25341,63.09102,83.133970,97.116040,103.041664
2,2020,30.250118,55.89034,64.46278,80.164950,96.258130,103.987564
3,2019,29.821560,54.22485,64.67055,75.120610,92.281830,100.752240

In [8]:
# find average individual rates differ from tobacco and non-tobaccor users
query_execute("SELECT businessyear, AVG(individualrate), AVG(individualtobaccorate) \
                FROM rate_table \
                WHERE tobacco LIKE 'Tobacco User/Non-Tobacco User'\
                GROUP BY businessyear")

c0b78979-f23b-44ba-b30d-85e12958eb73

In [9]:
s3.download_file('mikeproject', 'results/c0b78979-f23b-44ba-b30d-85e12958eb73.csv', 'tobacco_rate.csv')

In [10]:
pd.read_csv('tobacco_rate.csv', header=0, names=['year','individual_rate', 'tobacco_rate']).head()

   year  individual_rate  tobacco_rate
0  2020        591.51810     684.25790
1  2022        588.56790     671.98065
2  2019        615.62600     714.86743
3  2021        592.19867     681.81610

In [16]:
cte = """WITH combined as (SELECT rate_table.planid, rate_table.business_year, \
    rate_table.individual_rate, rules_table.dentalonlyplan \
    FROM rules_table INNER JOIN rate_table \
    ON rules_table.planid = rate_table.planid and \
    rules_table.businessyear = rate_table.business_year
    )"""

query_execute( cte + """ \
              SELECT business_year, planid, AVG(individual_rate), count(*) AS counts, dentalonlyplan\
              FROM combined \
              GROUP BY planid, business_year, dentalonlyplan
              """)

bcd3a73b-63ba-4839-9192-2d22afb2f0f6

In [18]:
s3.download_file('mikeproject', 'results/bcd3a73b-63ba-4839-9192-2d22afb2f0f6.csv', 'plan_rate.csv')

In [16]:
df_plan = pd.read_csv('plan_rate.csv', header=0, names=['year', 'planid', 'individual_rate', 'counts', 
                                                        'dentalonly'])

In [17]:
df_plan.head()

   year          planid  individual_rate  counts dentalonly
0  2019  73836AK0700014       815.981260     612         No
1  2019  21989AK0050001        41.107840     102        Yes
2  2019  53901AZ1420045       779.086700      51         No
3  2019  12538AL0010008        18.013802     663        Yes
4  2019  12538AL0020005        19.185053     663        Yes

In [9]:
query_execute("""SELECT state_code, AVG(individual_rate) \
                FROM rate_table \
                WHERE age NOT LIKE 'Family Option' and state_code IS NOT NULL
                and individual_rate IS NOT NULL
                GROUP BY state_code""")

89b9f9b2-583b-4ef9-b106-b15a83f742a1

In [16]:
# find average individual rates differ from states
query_execute("""SELECT state_code, (SUM(couple) + SUM(primary_subscriber_onedependent) +
                SUM(primary_subscriber_twodependents) + SUM(primary_subscriber_threeormoredependents) + SUM(couple_onedependent) + SUM(couple_twodependents) \
                + SUM(couple_threeormoredependents))/(COUNT(couple) + COUNT(primary_subscriber_onedependent) +
                COUNT(primary_subscriber_twodependents) + COUNT(primary_subscriber_threeormoredependents) + COUNT(couple_onedependent) + COUNT(couple_twodependents) \
                + COUNT(couple_threeormoredependents)) AS family_rate\
                FROM rate_table \
                WHERE age LIKE 'Family Option' and primary_subscriber_threeo
                GROUP BY state_code""")

dcd47bbf-9fc6-42e6-9378-1a232ebdc909

In [10]:
s3.download_file('mikeproject', 'results/89b9f9b2-583b-4ef9-b106-b15a83f742a1.csv', 'state_rate.csv')
pd.read_csv('state_rate.csv', header=0, names=['state', 'individual_rate']).head()

  state  individual_rate
0    ND        318.24527
1    VA        282.36975
2    KS        444.96353
3    WY        441.91397
4    AL        310.80713

In [17]:
s3.download_file('mikeproject', 'results/dcd47bbf-9fc6-42e6-9378-1a232ebdc909.csv', 'state_family_rate.csv')
pd.read_csv('state_family_rate.csv', header=0, names=['state', 'family_rate']).head()

  state  family_rate
0    NJ    84.124800
1    VA    55.957140
2    FL    57.697975
3    MO    43.356070
4    OH    70.001380

In [5]:
# find plan rate changes across years
query_execute("""SELECT planid_2019, planid_2020, planid_2021, planid_2022\
                FROM cross_table \
                WHERE reasonforcrosswalk_2022 IS NOT NULL
                """)

dd31f002-3015-4bc5-a475-b0487f3d76a4

In [6]:
s3.download_file('mikeproject', 'results/dd31f002-3015-4bc5-a475-b0487f3d76a4.csv', 'cross_rate.csv')
df_cross = pd.read_csv('cross_rate.csv', header=0, names=['planid_2019', 'planid_2020', 'planid_2021',
                                               'planid_2022'])

In [18]:
df_plan.head()

   year          planid  individual_rate  counts dentalonly
0  2019  73836AK0700014       815.981260     612         No
1  2019  21989AK0050001        41.107840     102        Yes
2  2019  53901AZ1420045       779.086700      51         No
3  2019  12538AL0010008        18.013802     663        Yes
4  2019  12538AL0020005        19.185053     663        Yes

In [11]:
df_cross.head()

      planid_2019     planid_2020     planid_2021     planid_2022
0  10046HI0020003  10046HI0020003  10046HI0020003  10046HI0020003
1  10046HI0020004  10046HI0020004  10046HI0020004  10046HI0020004
2  10046HI0020005  10046HI0020005  10046HI0020005  10046HI0020005
3  10046HI0020006  10046HI0020006  10046HI0020006  10046HI0020006
4  10091OR0720001  10091OR0720001  10091OR0720001  10091OR0720001

## Benefits and Cost Sharing

In [28]:
query_execute("""select businessyear, CopayInnTier1, count(*)
                from benefits_table
                WHERE CopayInnTier1 IS NOT NULL and businessyear IS NOT NULL
                Group by businessyear, CopayInnTier1 
                HAVING count(*) > 0
            """
              )

66a4eae9-f0b6-487a-99ec-2e9617518954

In [29]:
s3.download_file('mikeproject', 'results/66a4eae9-f0b6-487a-99ec-2e9617518954.csv', 'copayin.csv')
df_benefits = pd.read_csv('copayin.csv', header=0, names=['year', 'CopayInnet', 'counts'])

In [34]:
df_benefits.CopayInnet.nunique()

613

In [35]:
query_execute("""select businessyear, coinsinntier1, count(*)
                from benefits_table
                WHERE coinsinntier1 IS NOT NULL and businessyear IS NOT NULL
                Group by businessyear, coinsinntier1 
                HAVING count(*) > 0
            """
              )

c2a4b360-f6a1-462d-b2d3-ed386e6071d6

In [36]:
s3.download_file('mikeproject', 'results/c2a4b360-f6a1-462d-b2d3-ed386e6071d6.csv', 'coinsin.csv')
df_coin = pd.read_csv('coinsin.csv', header=0, names=['year', 'CoinsInnet', 'counts'])

In [38]:
df_coin.year.unique()

array([2022, 2020, 2019, 2021], dtype=int64)